package Cw_08_12_23;

import java.util.Arrays;

   //public class Train {
       //Написать метод , находящий минимальное количество платформ, необходимых для приема поездов
       //на станции в каждый момент времени. Известно время прибытия и отправления поездов ( расписание)

       //arrival[] = { 100, 140, 150, 200, 215, 400}
       //departure[] ={110, 300, 220, 230, 315, 600}

       //Алгоритм решения:
       //  1. Сортируем массивы прибытие и отправление
       //  2. Сравниваем в цикле текущие элементы массивов и выбираем меньший.
       //       Если элемент выбран из массива  прибытия - увеличиваем количество платформ.
       //       Если из отправления - уменьшаем
       //  3. Необходимо записывать текущее количество платформ в специально созданной для этого переменной.
       //  4. В конце возвращаем максимальное значение полученное для количества платформ.

    //   public static void main(String[] args) {
         //  int[] arrival = {100, 140, 150, 200, 215, 400};
       //    int[] departure = {110, 300, 220, 230, 315, 600};

        //   Arrays.sort(arrival);
       //   Arrays.sort(departure);

        //   System.out.println(Arrays.toString(arrival));
        //   System.out.println(Arrays.toString(departure));


         //  public int findNumberPlatform ( arrival[], departure[]){

              // int nowRemaider = 0;

             //  for (int n : arrival) {

                  // nowRemaider += n;
             //  }



         //  }

     //  }
 //  }
