package homework_29_11_23;

public class NumbInt {

    //Написать метод, принимающий массив целых чисел и проверяющий равна ли сумма всех имеющихся там чисел 10 тридцати.
    //Метод возвращает false если нет и true если да.
    //т.е. для массива 10, 15, 10, 1, 25, 10 -> true
    //для массива 10, 15, 10, 1, 25, 45 -> false
    //Фактически, в общем виде метод проверяет равна ли сумма всех элементов массива, равных n числу m

   // public static void main(String[] args) {


        //int[] array = {10, 15, 10, 1, 25, 10};

        //System.out.println(sumArray();


     //  public static boolean sumArray(int[] array ){

            int sum = 0;
            int n = 10;
            int m = 0;

           // for (int x : array) {

             //   if (x == n) {
                 //   sum = sum + x;
               // }


            }
            //System.out.println(sum);











